Autodesk.Revit.DB.Visual.Gradient.TextureVRepeat
The property labeled "V Repeat" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureURepeat
The property labeled "U Repeat" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureScaleLock
The property labeled "Scale Lock" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldScaleY
The property labeled "Size Y" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldScaleX
The property labeled "Size X" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDistance" with a minimum of "0.01".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureWAngle
The property labeled "Angle" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 360".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureOffsetLock
The property labeled "Offset Lock" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureRealWorldOffsetX
The property labeled "Offset X" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientType
The property labeled "Gradient Type" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientPosition
The property labeled "Position" from the "Gradient" schema.
Remarks:
This property is a "AssetPropertyList" of type "AssetPropertyDouble".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientNoiseSmooth
The property labeled "Smooth" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientNoiseSize
The property labeled "Size" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientNoisePhase
The property labeled "Phase" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientNoiseLow
The property labeled "Low" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientNoiseLevels
The property labeled "Levels" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "1, 10".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientNoiseHigh
The property labeled "High" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientNoiseAmount
The property labeled "Amount" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 1".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientNoise
The property labeled "Noise Type" from the "Gradient" schema.
Remarks:
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientNoiseType".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientInterpolation
The property labeled "Interpolation" from the "Gradient" schema.
Remarks:
This property is a "AssetPropertyList" of type "AssetPropertyInteger".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient.GradientColor
The property labeled "Color" from the "Gradient" schema.
Remarks:
This property is a "AssetPropertyList" of type "AssetPropertyDoubleArray4d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Gradient
Represents the properties of materials.
Since:
2018.1